# Import the helpers from the current folder "."
from . import csv_filter


def main_module_function():
    """
    +------------------------------------------------+
    |                                                |
    |             导入csv文件(data.csv)               |
    |                                                |
    +------------------------------------------------+
        |                                |
        |                                |
        |                                |
        V                                V
    +------------------------------------------------+
    |                                                |
    |     筛选数据                                    |
    |     条件：'唯一标识imei'是否'86'开头 == True     |
    |                                                |
    +------------------------------------------------+
        |                                |
        |                                |
        |                                |
        V                                V
    +------------------------------------------------+
    |                                                |
    |             导出到excel文件(output.xlsx)        |
    |             sheet1:原始数据                     |
    |             sheet2:符合条件的数据               |
    |             sheet3:不符合条件的数据             |
    |                                                |
    +------------------------------------------------+

    """
    app = csv_filter.CSVFilterApp()
    app.run()